# Initial EDA

In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
%matplotlib inline
import seaborn as sns
sns.set()
pd.set_option('display.max_columns',500)
from IPython.display import display
from scipy import stats

In [13]:
import sys
sys.path.append(r'C:\Users\User\Documents\Programming Practice\my_modules')

In [15]:
from trav_functions import *

# Load Data

In [1]:
data_raw = '../data/raw/'
data_interim = '../data/interim/'
data_external = '../data/external/'
data_processed = '../data/processed/'

In [2]:
df_train = pd.read_feather(data_interim + 'train_01.ftr')
df_test = pd.read_feather(data_interim + 'test_01.ftr')

df_train = df_train.set_index(df_train.columns[0])
df_test = df_test.set_index(df_test.columns[0])

C:\Users\User\Anaconda3\lib\site-packages\pyarrow\pandas_compat.py:752: FutureWarning: .labels was deprecated in version 0.24.0. Use .codes instead.
  labels, = index.labels

In [10]:
label = 'Survived'

# Label/Target Variable

In [11]:
df_train[label].value_counts(dropna=False)

False    549
True     342
Name: Survived, dtype: int64

# Univariate Variable Analysis

In [17]:
top_value_counts(df_train,only_categories=False)

Error, column(s) with float dtype included
The following columns will be excluded ['Age', 'Fare']

field  Survived         Pclass                                          Name  \
info        Cat Freq       Cat Freq                                      Cat
0      n_unique    2  n_unique    3                                 n_unique
1         False  549         3  491              McGowan, Miss. Anna "Annie"
2          True  342         1  216           Holverson, Mr. Alexander Oskar
3             -    -         2  184              Parrish, Mrs. (Lutie Davis)
4             -    -         -    -           Fortune, Miss. Alice Elizabeth
5             -    -         -    -  Bishop, Mrs. Dickinson H (Helen Walton)

field            Sex          SibSp          Parch         Ticket       \
info  Freq       Cat Freq       Cat Freq       Cat Freq       Cat Freq
0      891  n_unique    2  n_unique    7  n_unique    7  n_unique  681
1        1      male  577         0  608         0  678      1601    7
2        1    female  314         1  209         1  118    347082    7
3        1         -    -         2   28         2   80  CA. 2343    7
4        1         -    -         4   18         5    5   3101295    6
5        1         -    -         3   16         3    5   CA 2144    6

field        Cabin       Embarked
info           Cat Freq       Cat Freq
0         n_unique  147  n_unique    3
1              NaN  687         S  644
2          B96 B98    4         C  168
3               G6    4         Q   77
4      C23 C25 C27    4       NaN    2
5                D    3         -    -

In [23]:
df_train['Ticket'].value_counts().head(10)

1601            7
347082          7
CA. 2343        7
3101295         6
CA 2144         6
347088          6
S.O.C. 14879    5
382652          5
113781          4
17421           4
Name: Ticket, dtype: int64

In [24]:
df_test['Ticket'].value_counts()

PC 17608       5
113503         4
CA. 2343       4
C.A. 31029     3
347077         3
              ..
4133           1
W./C. 14266    1
PC 17569       1
347465         1
2681           1
Name: Ticket, Length: 363, dtype: int64

In [21]:
df_train.describe().round(2)

          Age   SibSp   Parch    Fare
count  714.00  891.00  891.00  891.00
mean    29.70    0.52    0.38   32.20
std     14.53    1.10    0.81   49.69
min      0.42    0.00    0.00    0.00
25%     20.12    0.00    0.00    7.91
50%     28.00    0.00    0.00   14.45
75%     38.00    1.00    0.00   31.00
max     80.00    8.00    6.00  512.33

## Individual Features

### Pclass

In [19]:
df_train['Pclass'].value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [25]:
df_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,None,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,None,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,None,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,None,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,None,S

In [26]:
df_test['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64